# 'brew tap'
tap "homebrew/cask-fonts"
#brew "font-UbuntuMono-nerd-font"
cask "font-code-new-roman-nerd-font"

# misc
brew "tree"
brew "watch"
brew "ykman"
brew "jq"
brew "keepassc"
brew "gawk"
brew "sshuttle"

# yabai and skhd
tap "koekeishiya/formulae"
brew "yabai"
brew "skhd"

# git
tap "git-chglog/git-chglog"
brew "git-chglog"
brew "git-crypt"
brew "pre-commit"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
brew "checkov"
brew "terrascan"
brew "infracost"
brew "tfupdate"
brew "jq"

# https://stackoverflow.com/questions/39494631/gpg-failed-to-sign-the-data-fatal-failed-to-write-commit-object-git-2-10-0
# ```
# echo "pinentry-program /opt/homebrew/bin/pinentry-mac" >> ~/.gnupg/gpg-agent.conf 
# killall gpg-agent
# ```
brew "gpg"
brew "pinentry-mac"

brew "curl"
brew "wget"
brew "httpie"

# local env
brew "asdf"
brew "direnv"

# k8s
brew "helm"
brew "k9s"
tap "datawire/blackbird"
brew "telepresence-arm64"
brew "step"

# cloud cli
brew "azure-cli"

# security
tap "datreeio/datree"
brew "datree"

# brew install mike-engel/jwt/jwt
tap "mike-engel/jwt-cli"
brew "jwt-cli"

brew "oauth2l"

tap "hashicorp/tap"

tap "aquasecurity/trivy"
brew "aquasecurity/trivy/trivy"

tap "noahgorstein/tap"
brew "noahgorstein/tap/jqp"

tap "xo/xo"
brew "usql"

tap "ankitpokhrel/jira-cli"
brew "jira-cli"

brew "javacc"

# jless.io - json viewer
brew "jless"
tap "k8sgpt-ai/k8sgpt"
brew "k8sgpt"

brew "ggshield"

# aws
tap "aws/tap"
brew "ec2-instance-selector"

# gitlab
# brew glab

tap "elva-labs/elva"
brew "awsesh"

# aerospace
tap "nikitabobko/tap"
cask "aerospace"
